#include "day06.h"
#include "day06.h"

void exercise_pointer02(void) {
    int a[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
    int* p = a;
    printf("%d\n", *p);
}
void exercise_pointer(void) {
    int a[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
    printf("01. %p\n", a);     // 배열타입=> int [3][4], 배열등가포인터=> int(*)[4]
    printf("02. %p\n", *a);    // 배열타입=> int [4], 배열등가포인터=> int *
    printf("03. %p\n", &a);    // 포인터타입 => int(*)[3][4
    printf("04. %p\n", a[0]);  // 배열타입=> int [4], 배열등가포인터=> int *
    printf("05. %d\n", *a[0]); // 정수 - a[0][0], **a, (*a)[0]
    printf("06. %d\n", *a[2]); // 정수 - a[2][0], **(a + 2), (*(a + 2))[0]
    printf("07. %d\n", *(*(a + 1) + 0));  // 정수 - a[1][0], *(*(a + 1))
    printf("08. %d\n", *(*(a + 0) + 2));  // 정수 - a[0][2]
    printf("09. %d\n", (*a + 2)[0]);      // 정수 - a[0][2]
    printf("10. %d\n", (*(a + 1))[0]);    // 정수 - a[1][0]
    printf("11. %d\n", (*(*a) + 1));      // 정수 - a[0][0] + 1 => 2
    //-----------------------
    printf("12. %p\n", &(a + 1)[2]);  // 포인터=> int(*) [4]
    char x[2][5] = { 10, 20 };
    char (*b[3][4])[2][5] = { &x };  //  &x, x, *x
    printf("13. %d\n", sizeof(b));   //  포인터가 3 * 4개 => 4 * 3 * 4 = 48
    printf("14. %d\n", b[0][0][0][0][0]);
    printf("15. %p\n", *a + 1);      // 포인터 - int *
    printf("16. %p\n", (a + 1)[2]);  // 배열 타입=> int[4], 배열등가포인터=> int*
    printf("17. %p\n", &(*a)[0]);    // 포인터 - int *
    printf("18. %p\n", a[1] + 2);    // 포인터 - int *  (1024)
    printf("19. %p\n", &*(*(a + 2)));// 배열타입=> int [4], 배열등가포인터=> int*

}